Enums/НДФЛСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НДФЛСтавки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ставка13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка15</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка22</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СлужебныйПолучитьСтавкуНДФЛ/Ext/Module.bsl
#Область ОбработчикиСобытий	

&НаСервере
Функция ПолучитьСтавкуНДФЛ(Ставка) Экспорт 
	СтавкаНДФЛЧисло = 0;  
	Если Ставка = Перечисления.НДФЛСтавки.Ставка13  Тогда 
		СтавкаНДФЛЧисло = 13;
	КонецЕсли;
	Если Ставка = Перечисления.НДФЛСтавки.Ставка15 Тогда 
		СтавкаНДФЛЧисло = 15;
	КонецЕсли;
	Если Ставка = Перечисления.НДФЛСтавки.Ставка18 Тогда
		СтавкаНДФЛЧисло = 18;
	КонецЕсли;
	Если Ставка = Перечисления.НДФЛСтавки.Ставка20 Тогда
		СтавкаНДФЛЧисло = 20;
	КонецЕсли;
	Если Ставка = Перечисления.НДФЛСтавки.Ставка22 Тогда
		СтавкаНДФЛЧисло = 22;
	КонецЕсли;
	Возврат СтавкаНДФЛЧисло;
	
КонецФункции			
		
#КонецОбласти
